## Production: backoff_retry_lambda

**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`  

**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show Plan</summary>

```terraform
aws_iam_policy.backoff_retry: Refreshing state... [id=arn:aws:iam::820252213580:policy/CovidAlertBackoffRetryLambda]
aws_iam_role.backoff: Refreshing state... [id=backoff_lambda_role]
aws_iam_role_policy_attachment.backoff_retry: Refreshing state... [id=backoff_lambda_role-20210531191444542600000001]
aws_security_group.backoff_retry_sg: Refreshing state... [id=sg-0ed581601fe3fe7fc]
aws_security_group_rule.privatelink_metrics_backoff_ingress: Refreshing state... [id=sgrule-798161409]
aws_lambda_function.backoff_retry: Refreshing state... [id=backoff_retry]
aws_cloudwatch_log_group.backoff_log_group: Refreshing state... [id=/aws/lambda/backoff_retry]
aws_cloudwatch_metric_alarm.backoff_retry_average_duration: Refreshing state... [id=save-metrics-average-duration]
aws_lambda_event_source_mapping.dead_letters: Refreshing state... [id=89578793-102f-4d07-8988-7cc0dca14eb7]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.backoff_retry_average_duration must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "backoff_retry_average_duration" {
      ~ alarm_name                            = "save-metrics-average-duration" -> "backoff-retry--average-duration" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:ca-central-1:820252213580:alarm:save-metrics-average-duration" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "save-metrics-average-duration" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

This plan was saved to: /home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary"
```
</details>